// Импортируем файл си эс эс
import { Fragment } from "react";
import "./TermCard.css";
// import { Fragment } from "react";
// Фрагмент это особый компонент который будет существовать только в виртуальном DOM и будет проигнорирован при комите в реальный DOM
// Реализуем компонент который будет представлять собой карточку с описанием термина. 
// React-компонент это функция возвращающая реакт элемент (элемент виртуального DOM).
// export const TermCard = () => {

// }
//  Элемент виртуального DOM это некий объект в котором React хранит информацию о DOM элементе который ему предстоит создать.
//  React-элемент же создаётся из React компонента или названия существующего HTML тега. Сделать это можно двумя способами
// Во первых с помощью функции криэйт элемент содержащейся внутри React:
// import { createElement} from "react";

// export const TermCard = () => {
//     return createElement("div")
// }

// Но более распространённый способ это создание элемента с помощью синтаксиса jsx,
//  позволяющему писать разметку похожую на HTML прямо внутри JS кода.
// Названия создаваемых React-компонентов всегда должны начинаться с заглавной буквы (например: TermCard) ,
//  чтобы отличать их от существующих HTML элементов, которые тоже могут быть использованы в jsx.

// Объявляем компонент TermCard как экспортируемую константу(это позволяет импортировать TermCard в других файлах), присваивая ей стрелочную функцию.
// Это функциональный компонент React, который не принимает пропсы (нет параметров в скобках). В реальном приложении здесь могли бы быть пропсы (например, <h2>{term}</h2>).
export const TermCard = ({ title, description, onDelete, id }) => {
    const handleDeleteClick = () => {
        // console.log("Удалить")
        onDelete(id)
    }
    // Возвращаем JSX‑разметку, которая будет отрендерена (финализирует в изображение) при вызове компонента.
    return (
     // Карточка термина состоит из самого термина и его описания
     // Основной контейнер карточки (блочный элемент).
     // В React каждый компонент должен возвращать один корневой элемент <div> (все остальные теги вкладываются внутрь него).
     <div className="term-card"> 
        <h2  className="term-card__title">{title}</h2>
         {/* Если description существует, то есть он не андэфаинед и не пустая строка, то возвращается тег «Р» и вставляется в вёрстку. 
         В противном случае возвращается нал, который в дом не попадёт  */}
         {/* {description ? (
        <p className="term-card__description">{description}</p>
         ) : null}  */}
        {/* Или можно написать более лаконично: */}
         {description && (
        <p className="term-card__description">{description}</p>
         )}
         <button
          type="button"
           className="term-card_delete"
           onClick={handleDeleteClick}>
            Удалить
            </button> 
    </div>
    // Так же можно передавать проп (переменные) методом children. 
    // Обычно он используется для передачи дочерних элементов компоненту,
    //  путём вставки их между открывающим и закрывающим jsx тегами компонентов. 
    // <div 
    // className="term-card"
    // children={[
    //     <h2  className="term-card__title">{title}</h2>
    //     <p className="term-card__description">{description}</p>
    // ]}></div>
    // в данном случае здесь явным образом создаётся массив, состоящий из дочерних элементов.
    //  Но таким образом код становится менее наглядным и похожим на HTML
    
    // Так же вместо заключения в массив можно объединить несколько jsx элементов в один
    //  с помощью встроенного в React компонентов фрагмент. 
     // className="term-card"
    // children={
    //     <Fragment>
    //     <h2  className="term-card__title">{title}</h2>
    //     <p className="term-card__description">{description}</p>
    //     </Fragment>
    // }></div>
    );
};

